{
    "system_message": "You are an AI that breaks down complex tasks into hierarchical steps. For each task, generate a set of sub-steps needed to complete it. Maintain clarity and logical order. IMPORTANT: Avoid duplicating steps that already exist elsewhere in the tree context provided. Focus on sub-steps that are specific to the current task being expanded. Format your response as a valid JSON array of step objects, where each object has a 'step' field and optionally a 'children' array containing substeps. Example format: [{'step': 'Main step 1', 'children': [{'step': 'Substep 1.1'}, {'step': 'Substep 1.2'}]}, {'step': 'Main step 2'}] Your entire response must be parseable as JSON. Do not include markdown formatting, code blocks, or commentary.",
    "user_message": "Break down the following task into 3-7 sub-steps. Task: Establish Security Protocols for Edge Devices\n\nDo NOT repeat steps that have already been created in the tree unless ABSOLUTELY NECESSARY.\nFocus on sub-steps that are specific to this task and avoid duplicating steps that already exist in the broader process.\n\n\nExisting steps in the tree (avoid duplicating these): Edge Computing, Define the Scope of Edge Computing Application, Identify Key Business Objectives Driving Edge Computing, Determine Geographic Locations for Edge Deployment, Specify Data Types to be Processed at the Edge, Define Acceptable Response Time Thresholds for Each Application, Establish Boundaries of Data Residency Requirements, Identify Critical Operational Requirements for the Edge Application, Identify Data Sources and Volume, Conduct Initial Data Source Inventory, Identify Internal Data Systems, List all internal databases and applications, Document data schemas for each system, Explore External Data Sources, Identify potential partners and vendors, Research publicly available datasets, Assess Data Volume for Each Source, Determine Data Generation Rates, Analyze current data ingestion rates, Project future data growth based on trends, Estimate Data Storage Requirements, Calculate total data volume (TB, PB, etc.), Determine storage capacity needs for each source, Document Data Source Characteristics, Record Data Source Type, Classify data sources (e.g., IoT, mobile, web), Note data formats and protocols, Assess Data Quality, Perform initial data quality checks, Identify potential data cleansing requirements, Determine Latency Requirements, Define Latency Goals Based on User Experience, Identify Critical User Actions and their Latency Impact, Establish Latency Thresholds for Each User Scenario, Analyze Application Dependencies and Latency Contribution, Document Latency Requirements in a Formal Specification, Select Appropriate Edge Device Hardware, Evaluate Hardware Specifications based on Data Volume Requirements, Determine the required processing power (CPU, GPU) based on data analytics needs, Assess memory (RAM) requirements for handling data streams and application workloads, Evaluate storage capacity needs based on initial data volume estimates, Assess Connectivity Requirements, Determine bandwidth needs based on data transfer rates, Evaluate network latency requirements for real-time data processing, Assess support for various network protocols (e.g., MQTT, CoAP), Evaluate Hardware Security Features, Assess hardware-level security features (e.g., Trusted Platform Module - TPM), Evaluate secure boot and firmware update mechanisms, Assess physical security considerations (e.g., ruggedization, tamper resistance), Consider Device Form Factor and Deployment Environment, Evaluate physical size constraints for the deployment location, Assess environmental factors (e.g., temperature, humidity, vibration), Evaluate power consumption requirements and options (e.g., PoE, battery), Design Network Connectivity Strategy, Define Network Connectivity Goals, Determine Network Architecture (e.g., Star, Mesh), Specify Connectivity Protocols (e.g., MQTT, CoAP), Analyze Network Bandwidth Requirements, Assess Data Transfer Rates for Each Source, Calculate Peak Bandwidth Demand, Evaluate Network Latency, Identify Latency-Critical Applications, Establish Latency Thresholds, Select Network Technologies, Evaluate Cellular Connectivity (5G, LTE), Evaluate Wi-Fi Technologies (e.g., Wi-Fi 6), Evaluate Satellite Connectivity (if applicable), Implement Data Processing and Analysis at the Edge, Develop Data Processing Pipelines, Implement Data Analysis Algorithms, Configure Data Streaming from Sources, Deploy and Monitor Edge Processing Units, Validate Analysis Results Against Business Objectives, Establish Security Protocols for Edge Devices\n\nReturn ONLY a JSON array of step objects, with no markdown formatting, code blocks, or extra text.",
    "timestamp": "2025-06-01T20:33:37.007660"
}