{
    "system_message": "You are an AI that breaks down complex tasks into hierarchical steps. For each task, generate a set of sub-steps needed to complete it. Maintain clarity and logical order. IMPORTANT: Avoid duplicating steps that already exist elsewhere in the tree context provided. Focus on sub-steps that are specific to the current task being expanded. Format your response as a valid JSON array of step objects, where each object has a 'step' field and optionally a 'children' array containing substeps. Example format: [{'step': 'Main step 1', 'children': [{'step': 'Substep 1.1'}, {'step': 'Substep 1.2'}]}, {'step': 'Main step 2'}] Your entire response must be parseable as JSON. Do not include markdown formatting, code blocks, or commentary.",
    "user_message": "Break down the following task into 3-7 sub-steps. Task: Second rise – Allow loaves to rise again\n\nDo NOT repeat steps that have already been created in the tree unless ABSOLUTELY NECESSARY.\nFocus on sub-steps that are specific to this task and avoid duplicating steps that already exist in the broader process.\n\n\nExisting steps in the tree (avoid duplicating these): Breadmaking, Measure and combine dry ingredients, Gather all dry ingredients., Accurately measure each dry ingredient using appropriate measuring tools (cups, spoons, scales)., Sift dry ingredients together to remove lumps and ensure even distribution., Transfer measured dry ingredients to a clean mixing bowl., Activate the yeast, Check Yeast Expiration Date, Warm Water Preparation, Add Yeast to Warm Water, Let Yeast Bloom, Observe Yeast Activation, Add wet ingredients to the dough, Prepare wet ingredients: Gather milk, eggs, oil, or other liquid components., Assess wet ingredient temperature: Ensure liquids are at the required temperature (e.g., room temperature)., Pour wet ingredients into mixing bowl, Gently incorporate wet ingredients into the dry ingredients, Knead the dough, Prepare the work surface: Lightly flour a clean counter or surface., Add Dough Ingredients: Place all dough ingredients (flour, yeast, salt, water) into the mixing bowl., Initial Mixing: Using a spoon or your hands, mix the ingredients until a shaggy dough forms., Begin Kneading: Start pressing down and pushing the dough away from you with the heel of your hand., Increase Kneading Intensity: Increase pressure and speed while continuing to push the dough away from you., Monitor Dough Texture: Check the dough's elasticity and consistency during kneading., Complete Kneading: Continue kneading for the recommended time (typically 8-10 minutes), until the dough is smooth and elastic., First rise – Allow dough to double in size, Prepare the Dough Mixture: Combine all dry ingredients in a mixing bowl., Activate Yeast: Add warm water to the yeast mixture., Cover Dough: Loosely cover the mixing bowl with plastic wrap or a damp towel., Monitor Dough Rise: Check the dough’s volume every 30-60 minutes., Observe Rise: Note the time and percentage increase in dough size., Determine Rise Completion: Assess if the dough has doubled in size., Shape the dough into loaves, Divide dough into appropriate loaf sizes., Press dough into a loaf pan., Smooth the top surface of the dough in the loaf pan., Score the dough surface with a sharp knife or lame to create desired shaping., Place the shaped loaf into a preheated oven., Second rise – Allow loaves to rise again\n\nReturn ONLY a JSON array of step objects, with no markdown formatting, code blocks, or extra text.",
    "timestamp": "2025-06-02T19:56:13.073561"
}