{
    "system_message": "You are an AI that breaks down complex tasks into hierarchical steps. For each task, generate a set of sub-steps needed to complete it. Maintain clarity and logical order. IMPORTANT: Avoid duplicating steps that already exist elsewhere in the tree context provided. Focus on sub-steps that are specific to the current task being expanded. Format your response as a valid JSON array of step objects, where each object has a 'step' field and optionally a 'children' array containing substeps. Example format: [{'step': 'Main step 1', 'children': [{'step': 'Substep 1.1'}, {'step': 'Substep 1.2'}]}, {'step': 'Main step 2'}] Your entire response must be parseable as JSON. Do not include markdown formatting, code blocks, or commentary.",
    "user_message": "Break down the following task into 3-7 sub-steps. Task: Maintain Audit Trail\n\nDo NOT repeat steps that have already been created in the tree unless ABSOLUTELY NECESSARY.\nFocus on sub-steps that are specific to this task and avoid duplicating steps that already exist in the broader process.\n\n\nExisting steps in the tree (avoid duplicating these): Automated Compliance Management, Define Compliance Requirements, Determine Scope of Compliance, Identify Key Stakeholders, Research Applicable Regulations, Document Compliance Objectives, Specify Metrics for Measuring Compliance, Detail Specific Requirements for Each Metric, Identify Relevant Regulations, Conduct Initial Regulatory Landscape Scan, Categorize Regulations by Sector/Industry, Filter Regulations Based on Defined Compliance Requirements, Assess Regulatory Jurisdiction and Applicability, Evaluate Regulatory Text for Key Requirements, Document Rationale for Inclusion of Each Regulation, Establish Data Collection Mechanisms, Select Data Collection Tools, Evaluate Data Collection Platforms, Assess Tool Capabilities, Consider Data Sources, Identify Potential Data Streams, Define Data Collection Protocols, Establish Data Collection Frequency, Determine Data Collection Methods, Choose Appropriate Data Gathering Techniques, Configure Data Collection Systems, Set up Data Collection Processes, Integrate Data Collection Tools, Implement Automated Monitoring, Configure Monitoring System Architecture, Select Monitoring Platform, Assess Platform Features, Evaluate Scalability, Assess Reporting Capabilities, Review Integration Options, Define Monitoring Scope Parameters, Specify Target Systems, Define Monitoring Levels, Implement Data Collection Rules, Configure Data Collection Triggers, Set Thresholds for Metrics, Define Event Conditions, Establish Data Streams, Connect to Data Sources, Map Data Fields, Configure Alerting and Notifications, Define Alerting Rules, Set Alert Severity Levels, Configure Notification Channels, Test Alerting System, Simulate Trigger Events, Verify Notification Delivery, Configure Alerting Rules, Determine Alerting Requirements, Identify Critical Events, Determine Severity Levels, Define Alerting Rule Parameters, Specify Trigger Conditions, Define Actionable Events, Configure Alerting Rule Execution, Select Notification Methods, Define Escalation Procedures, Test and Validate Alerting Rules, Create Test Cases, Execute Test Cases, Analyze Test Results, Generate Compliance Reports, Gather Data from Identified Sources, Transform Data for Reporting, Generate Initial Report Draft, Review Report for Accuracy, Validate Report Findings, Finalize Report Formatting, Distribute Compliance Reports, Maintain Audit Trail\n\nReturn ONLY a JSON array of step objects, with no markdown formatting, code blocks, or extra text.",
    "timestamp": "2025-06-01T20:05:57.400896"
}