{
    "system_message": "You are an AI that breaks down complex tasks into hierarchical steps. For each task, generate a set of sub-steps needed to complete it. Maintain clarity and logical order. IMPORTANT: Avoid duplicating steps that already exist elsewhere in the tree context provided. Focus on sub-steps that are specific to the current task being expanded. Format your response as a valid JSON array of step objects, where each object has a 'step' field and optionally a 'children' array containing substeps. Example format: [{'step': 'Main step 1', 'children': [{'step': 'Substep 1.1'}, {'step': 'Substep 1.2'}]}, {'step': 'Main step 2'}] Your entire response must be parseable as JSON. Do not include markdown formatting, code blocks, or commentary.",
    "user_message": "Break down the following task into 3-7 sub-steps. Task: Test and Validate SDN Functionality\n\nDo NOT repeat steps that have already been created in the tree unless ABSOLUTELY NECESSARY.\nFocus on sub-steps that are specific to this task and avoid duplicating steps that already exist in the broader process.\n\n\nExisting steps in the tree (avoid duplicating these): Software Defined Networking (SDN), Define SDN Architecture Goals, Identify Key Business Requirements, Determine Network Performance Objectives, Define Scalability Requirements, Establish Security Goals for the SDN Environment, Document Control Plane and Data Plane Separation Strategy, Outline Automation and Orchestration Needs, Select SDN Controller Technology, Research SDN Controller Technologies, Evaluate Controller Features Against Requirements, Assess Vendor Support and Community, Compare Scalability and Performance Capabilities, Analyze Total Cost of Ownership (TCO), Determine Controller API Compatibility, Document Controller Selection Rationale, Identify Network Devices for SDN Integration, Inventory Existing Network Hardware, Compile a List of All Network Devices, Identify all routers, switches, firewalls, load balancers, and wireless access points., Record Manufacturer, Model, and Serial Number for Each Device, Determine Device Connectivity and Protocols, Document IP Addresses, Subnets, and VLANs Assigned to Each Device., Identify Supported Protocols (e.g., TCP/IP, BGP, OSPF) for Each Device., Assess Device Compatibility with SDN, Evaluate Device Software Support, Check for existing APIs or management interfaces that can be leveraged., Determine if device firmware can be updated to support SDN protocols., Analyze Device Hardware Capabilities, Assess the device's processing power and memory for SDN controller interaction., Determine if the device supports necessary network extensions for SDN control., Configure SDN Controller with Network Devices, Gather Device Inventory Information, Assess Device Compatibility with SDN Protocols, Configure Initial Device Connectivity, Establish Communication Channels between Controller and Devices, Implement Basic Network Policies via Controller, Verify Device Responses to Controller Commands, Document Device Configuration Changes, Implement Network Policies via SDN Controller, Select SDN Controller Implementation Methodology (e.g., OpenFlow, P4), Configure Controller with Network Device Discovery Protocol, Define Initial Policy Templates, Deploy Policy Templates to Network Devices, Monitor Policy Enforcement and Device Response Times, Adjust Policy Parameters Based on Initial Monitoring Results, Monitor SDN Controller and Network Performance, Establish Baseline Network Performance Metrics, Configure SDN Controller Monitoring Tools, Collect Real-time Network Performance Data, Analyze Collected Data for Anomalies, Correlate Controller Performance Metrics with Network Device Performance, Generate Performance Reports and Alerts, Test and Validate SDN Functionality\n\nReturn ONLY a JSON array of step objects, with no markdown formatting, code blocks, or extra text.",
    "timestamp": "2025-06-01T21:44:17.705249"
}